from typing import Final

MAPPING: Final = {
    "ᚠ": "f",
    "ᚢ": "u",
    "ᚦ": "þ",
    "ᚩ": "o",
    "ᚱ": "r",
    "ᚳ": "c",
    "ᚷ": "g",
    "ᚹ": "w",
    "ᚻ": "h",
    "ᚾ": "n",
    "ᛁ": "i",
    "ᛡ": "j",
    "ᛄ": "j",
    "ᛇ": "ï",
    "ᛈ": "p",
    "ᛉ": "x",
    "ᛋ": "s",
    "ᚴ": "s",
    "ᛏ": "t",
    "ᛒ": "b",
    "ᛖ": "e",
    "ᛗ": "m",
    "ᛚ": "l",
    "ᛝ": "ŋ",
    "ᛟ": "œ",
    "ᛞ": "d",
    "ᚪ": "a",
    "ᚫ": "æ",
    "ᚣ": "y",
    "ᛠ": "ea",
    ":": " ",
}


def get_rune_mapping() -> dict[str, str]:
    return MAPPING
