# -*- coding: utf-8 -*-
# Это программа для разработки, если вы случайно тут, то выйдите, пожалуйста, и ничего не ломайте
# ID меняется вручную, молю всех не продолбить это (я перед экзом поревьюю, но не обещаю)
# если вы не уверены в задаче, но хотите ее добавить в базу, пишите тем, кто знает тервер чтобы проверили
# если вы считаете, что это говнокод и соберете лучше -- пишите свою либу и шерьте со всеми
# если вы пришли с фичреквестом -- пишите dashkaz или rozyev23

import json
import scipy.stats
import statistics
import pathlib


my_own_task = {
    "id" : 1,
    "unit": "q3",
    "task_text": r'34. Случайная выборка из 395 человек была разделена по возрастному признаку, а также по тому, переключают ли люди телевизионные каналы во время просмотра передачи. Данные исследования 8 представлены в следующей таблице: Используя приведенные данные, проверьте на 5% -уровне значимости гипотезу о том, что переключение каналов и возраст являются независмимыми признаками Найдите P-значение критерия.',
    "task_solution_code_analytics":
        """
scupy.solve_some_dificult_number_34()
        """
}
new_task = json.dumps(my_own_task, ensure_ascii=False)
with open(pathlib.Path(pathlib.Path(pathlib.Path.cwd(), "tasks_base.txt")), "a", encoding="UTF8") as f:
    f.write(new_task)
    f.write("\n")
