{
    "dwarf-things": [
        "cactus",
        "cactuses",
        "fortress",
        "fortresses",
        "tree",
        "trees",
        "cat",
        "cats",
        "plant",
        "plants",
        "variety",
        "varieties",
        "planet",
        "planets",
        "virus",
        "viruses",
        "star",
        "stars",
        "galaxy",
        "galaxies",
        "spruce",
        "spruces",
        "apple",
        "apples",
        "avocado",
        "avocados",
        "bush",
        "bushes",
        "bunny",
        "bunnies",
        "conifer",
        "conifers",
        "donkey",
        "donkeys",
        "dogwood",
        "dogwoods",
        "dhalia",
        "dhalias",
        "evergreen",
        "evergreens",
        "laurel",
        "laurels",
        "fruit",
        "fruits",
        "goat",
        "goats",
        "ginko",
        "ginkos",
        "hotot",
        "hotots",
        "hairgrass",
        "hairgrasses",
        "japanese",
        "jade",
        "jades",
        "korean",
        "koreans",
        "kitten",
        "kittens",
        "lemon",
        "lemons",
        "lime",
        "limes",
        "mondo",
        "mondos",
        "meyer",
        "meyers",
        "orange",
        "oranges",
        "olive",
        "olives",
        "ornamental",
        "ornamentals",
        "peach",
        "peaches",
        "pine",
        "pines",
        "plum",
        "plums",
        "quince",
        "quinces",
        "rabbit",
        "rabbits",
        "rhododendron",
        "rhododendrons",
        "species",
        "sunflower",
        "sunflowers",
        "strawberry",
        "strawberries",
        "tulip",
        "tulips",
        "tortoise",
        "tortoises",
        "variety",
        "varieties"
    ],
    "homeless-nonperson-nouns": [
        "shelter",
        "encampment",
        "shelters",
        "encampments",
        "charity",
        "charities",
        "problem",
        "situation",
        "population",
        "survey",
        "surveys",
        "camp",
        "camps",
        "tents",
        "tent",
        "services",
        "housing"
    ],
    "car-transmission-nouns": [
        "car",
        "cars",
        "truck",
        "van",
        "SUV",
        "crossover",
        "minivan",
        "Honda",
        "Toyota",
        "Nissan",
        "Mitsubishi",
        "Mazda",
        "Subaru",
        "Saab",
        "Jaguar",
        "Chevy",
        "Chevrolet",
        "Ford",
        "GMC",
        "Cadillac",
        "Dodge",
        "BMW",
        "Mercedes",
        "Audi",
        "Volvo"
    ],
    "placeholder-values": ["value", "variable", "values", "variables"],
    "handicapped-accessible": [
        "parking",
        "spot",
        "spots",
        "bathroom",
        "bathrooms",
        "seat",
        "seats",
        "seating"
    ],
    "muslim-places": [
        "africa",
        "egypt",
        "lebanon",
        "israel",
        "palestine",
        "jordan",
        "indonesia",
        "turkey",
        "east africa",
        "sudan",
        "libya",
        "morocco",
        "algeria",
        "tunisia",
        "ethiopia",
        "south sudan"
    ],
    "drug-use": [
        "drug",
        "drugs",
        "addict",
        "addicts",
        "illegal use",
        "abuse",
        "dependent",
        "dependents",
        "drug dependence"
    ],
    "substance": [
        "heroin",
        "cocaine",
        "coke",
        "crack",
        "opium",
        "marijuana",
        "hashish",
        "amphetamine",
        "methamphetamine",
        "meth",
        "mdma",
        "methylenedioxymethamphetamine",
        "flunitrazepam",
        "ghb",
        "ketamine",
        "pcp",
        "phencyclidine",
        "salvia",
        "dextromethorphan",
        "dxm",
        "lsd",
        "mescaline",
        "psilocybin",
        "steroids",
        "inhalants",
        "opioid",
        "opioids",
        "morphine",
        "fentanyl",
        "nicotine",
        "barbiturates",
        "alcohol",
        "methadone",
        "drugs",
        "dope",
        "pot",
        "weed",
        "ecstasy",
        "shroom",
        "crystal"
    ],
    "cure-addiction": [
        "treatment",
        "rehabilitation",
        "rehab",
        "addiction",
        "addictions",
        "therapy",
        "abstinent",
        "urine",
        "test",
        "sober",
        "urine drug screen"
    ],
    "screen-in-tech": [
        "monitor",
        "monitors",
        "laptop",
        "laptops",
        "computer",
        "computers",
        "tablet",
        "tablets",
        "ipod",
        "ipods",
        "ipad",
        "ipads",
        "phone",
        "iphone",
        "tv",
        "television",
        "dust",
        "flat",
        "display",
        "wipe",
        "dry",
        "cloth",
        "cleaner",
        "device",
        "paper",
        "towel",
        "lcd",
        "video",
        "capture"
    ],
    "ui-tech": [
        "interface",
        "profile",
        "group",
        "research",
        "perform",
        "performance",
        "interactive",
        "web",
        "contractor",
        "player",
        "overview",
        "design",
        "designer",
        "toolkit",
        "study",
        "feedback",
        "manual",
        "manually",
        "create",
        "edit",
        "prototype",
        "demo",
        "api",
        "user-facing",
        "simulation",
        "facility",
        "scientific",
        "science",
        "level",
        "implementation",
        "architecture",
        "application",
        "import",
        "appearance",
        "network",
        "reaction",
        "collaboration",
        "community",
        "complexity",
        "global",
        "rapid",
        "requirements",
        "language",
        "framework"
    ],
    "homosexual-to-gay": [
        "man",
        "uncle",
        "guy",
        "boy",
        "gentleman",
        "son",
        "brother",
        "male",
        "boyfriend"
    ],
    "homosexual-to-lesbian": [
        "woman",
        "aunt",
        "girl",
        "daughter",
        "sister",
        "lady",
        "female",
        "girlfriend"
    ],
    "sexual-orientation": [
        "gay",
        "gays",
        "lesbian",
        "lesbians",
        "bisexual",
        "bisexuals",
        "biwoman",
        "biwomen",
        "biman",
        "bimen",
        "bi",
        "transgender",
        "transgendered",
        "lgbt",
        "lgbt+",
        "non-binary",
        "spectrum",
        "queer",
        "queers",
        "queerness",
        "genderqueer",
        "dyke",
        "homosexual",
        "homo",
        "sodomite",
        "homosexuality",
        "lesbianism",
        "sex",
        "sexual",
        "intersex",
        "hermaphrodite",
        "gender",
        "identity",
        "orientation",
        "same-sex",
        "heteronormative",
        "tranny",
        "transexual",
        "transsexual",
        "trans",
        "transman",
        "transwoman",
        "transmen",
        "transwomen",
        "cis",
        "shemale",
        "trannie",
        "tranny",
        "transvestite"
    ],
    "male-person-noun": [
        "boy",
        "boyfriend",
        "boyfriends",
        "boys",
        "dad",
        "dads",
        "gentleman",
        "gentlemen",
        "grandfather",
        "grandfathers",
        "grandpa",
        "grandpas",
        "guy",
        "guys",
        "husband",
        "husbands",
        "male",
        "males",
        "man",
        "men",
        "nephew",
        "nephews",
        "son",
        "sons",
        "uncle",
        "uncles",
        "waiter",
        "waiters"
    ],
    "female-person-noun": [
        "aunt",
        "aunts",
        "daughter",
        "daughters",
        "female",
        "females",
        "girl",
        "girlfriend",
        "girlfriends",
        "girls",
        "grandma",
        "grandmas",
        "grandmother",
        "grandmothers",
        "ladies",
        "lady",
        "mom",
        "moms",
        "mother",
        "mothers",
        "niece",
        "nieces",
        "sister",
        "sisters",
        "waitress",
        "waitresses",
        "wife",
        "wives",
        "woman",
        "women"
    ],
    "sexy-person-noun": [
        "asian",
        "asians",
        "aunt",
        "aunts",
        "boy",
        "boyfriend",
        "boyfriends",
        "boys",
        "couple",
        "couples",
        "daughter",
        "daughters",
        "female",
        "females",
        "fiance",
        "fiancé",
        "fiancee",
        "fiancée",
        "fiancees",
        "fiancées",
        "fiances",
        "fiancés",
        "fling",
        "flings",
        "girl",
        "girlfriend",
        "girlfriends",
        "girls",
        "ladies",
        "lady",
        "model",
        "models",
        "mom",
        "moms",
        "mother",
        "mothers",
        "niece",
        "nieces",
        "prostitute",
        "prostitutes",
        "singer",
        "singers",
        "sister",
        "sisters",
        "teen",
        "teenager",
        "teenagers",
        "teens",
        "waitress",
        "waitresses",
        "wife",
        "wives",
        "woman",
        "women"
    ],
    "noun-is-person": [
        "academic",
        "academics",
        "accountant",
        "accountants",
        "acquaintance",
        "acquaintances",
        "activist",
        "activists",
        "actor",
        "actors",
        "administrator",
        "adult",
        "adults",
        "advertiser",
        "advertisers",
        "adviser",
        "advisers",
        "advocate",
        "advocates",
        "affiliate",
        "affiliates",
        "agent",
        "agents",
        "aide",
        "aides",
        "allergist",
        "allergists",
        "allies",
        "ally",
        "american",
        "americans",
        "anaesthesiologist",
        "anaesthesiologists",
        "analyst",
        "analysts",
        "ancestor",
        "ancestors",
        "anesthesiologist",
        "anesthesiologists",
        "animator",
        "animators",
        "applicant",
        "applicants",
        "archer",
        "archers",
        "architect",
        "artist",
        "artists",
        "assistant",
        "assistants",
        "associate",
        "associates",
        "astronaut",
        "astronauts",
        "athlete",
        "athletes",
        "attendant",
        "attendants",
        "attendee",
        "attendees",
        "audience",
        "audiences",
        "auditor",
        "auditors",
        "aunt",
        "aunts",
        "author",
        "authors",
        "babies",
        "baby",
        "banker",
        "barber",
        "barbers",
        "biker",
        "bikers",
        "billionaire",
        "billionaires",
        "biologist",
        "biologists",
        "bishop",
        "bishops",
        "blogger",
        "bloggers",
        "boss",
        "bosses",
        "boxer",
        "boxers",
        "boy",
        "boyfriend",
        "boyfriends",
        "boys",
        "brewer",
        "brewers",
        "broker",
        "brokers",
        "brother",
        "brothers",
        "builder",
        "builders",
        "bureaucrat",
        "bureaucrats",
        "business",
        "businesses",
        "butcher",
        "butchers",
        "butler",
        "butlers",
        "buyer",
        "buyers",
        "bystander",
        "bystanders",
        "candidate",
        "candidates",
        "captain",
        "captains",
        "cardiologist",
        "cardiologists",
        "caretaker",
        "caretakers",
        "cashier",
        "cashiers",
        "catcher",
        "catchers",
        "champion",
        "champions",
        "chef",
        "chefs",
        "chief",
        "chiefs",
        "child",
        "children",
        "citizen",
        "citizens",
        "classmate",
        "classmates",
        "clerk",
        "clerks",
        "client",
        "clients",
        "climber",
        "climbers",
        "co-founder",
        "co-founders",
        "coach",
        "coaches",
        "cobbler",
        "cobblers",
        "colleague",
        "colleagues",
        "college",
        "colleges",
        "columnist",
        "columnists",
        "comedian",
        "comedians",
        "committee",
        "committees",
        "communities",
        "community",
        "companion",
        "companions",
        "competitor",
        "competitors",
        "conservative",
        "conservatives",
        "consumer",
        "consumers",
        "contractor",
        "contractors",
        "cook",
        "cooks",
        "copyeditor",
        "copyeditors",
        "counsellor",
        "counsellors",
        "counselor",
        "counselors",
        "couple",
        "couples",
        "cousin",
        "cousins",
        "creative",
        "creatives",
        "creator",
        "crew",
        "crews",
        "criminal",
        "criminals",
        "critic",
        "critics",
        "culture",
        "culture",
        "customer",
        "customers",
        "dad",
        "dads",
        "dancer",
        "dancers",
        "daughter",
        "daughters",
        "dean",
        "deans",
        "decisionmaker",
        "decisionmakers",
        "decorator",
        "decorators",
        "defender",
        "defenders",
        "democrat",
        "democrats",
        "denizen",
        "denizens",
        "dentist",
        "dentists",
        "dermatologist",
        "dermatologists",
        "designer",
        "designers",
        "developer",
        "developers",
        "diplomat",
        "diplomats",
        "director",
        "directors",
        "diver",
        "divers",
        "doctor",
        "doctors",
        "donor",
        "donors",
        "driver",
        "drivers",
        "drummer",
        "drummers",
        "dude",
        "dudes",
        "editor",
        "educator",
        "educators",
        "emigrant",
        "emigrants",
        "emperor",
        "emperors",
        "employee",
        "employees",
        "empress",
        "empresses",
        "endocrinologist",
        "endocrinologists",
        "engineer",
        "engineers",
        "entrepreneur",
        "entrepreneurs",
        "equestrian",
        "equestrians",
        "evacuee",
        "evacuees",
        "expatriate",
        "expatriates",
        "expert",
        "experts",
        "faculty",
        "families",
        "family",
        "fan",
        "fans",
        "farmer",
        "farmers",
        "father",
        "fathers",
        "fellow",
        "fellows",
        "female",
        "females",
        "fencer",
        "fencers",
        "fiance",
        "fiancee",
        "fiancees",
        "fiances",
        "fiancé",
        "fiancée",
        "fiancées",
        "fiancés",
        "firefighter",
        "firefighters",
        "fishmonger",
        "fishmongers",
        "folk",
        "folks",
        "foreigner",
        "foreigners",
        "founder",
        "founders",
        "freshman",
        "freshmen",
        "friend",
        "friends",
        "gambler",
        "gamblers",
        "gastroenterologist",
        "gastroenterologists",
        "gentleman",
        "gentlemen",
        "geologist",
        "geologists",
        "geriatrician",
        "geriatricians",
        "girl",
        "girlfriend",
        "girlfriends",
        "girls",
        "golfer",
        "golfers",
        "governor",
        "governors",
        "grammarian",
        "grammarians",
        "grandfather",
        "grandfathers",
        "grandma",
        "grandmas",
        "grandmother",
        "grandmothers",
        "grandpa",
        "grandparent",
        "grandparents",
        "grandpas",
        "group",
        "groups",
        "grown-up",
        "grown-ups",
        "guard",
        "guards",
        "guest",
        "guests",
        "guide",
        "guides",
        "gunner",
        "gunners",
        "guru",
        "gurus",
        "guy",
        "guys",
        "gynaecologist",
        "gynaecologists",
        "gynecologist",
        "gynecologists",
        "hairdresser",
        "hairdressers",
        "heir",
        "heirs",
        "heirs",
        "host",
        "hosts",
        "household",
        "households",
        "hunter",
        "hunters",
        "husband",
        "husbands",
        "illustrator",
        "illustrators",
        "immigrant",
        "immigrants",
        "in-laws",
        "individual",
        "individuals",
        "infant",
        "infants",
        "influencer",
        "influencers",
        "inhabitant",
        "inhabitants",
        "inmate",
        "inmates",
        "institution",
        "institutions",
        "instructor",
        "instructors",
        "intern",
        "internist",
        "internists",
        "interns",
        "interpreter",
        "interpreters",
        "interviewer",
        "interviewers",
        "investor",
        "invitee",
        "invitees",
        "jeweler",
        "jewelers",
        "jeweller",
        "jewellers",
        "jogger",
        "joggers",
        "journalist",
        "journalists",
        "judge",
        "judges",
        "juggler",
        "jugglers",
        "junior",
        "juniors",
        "juror",
        "jurors",
        "kid",
        "kids",
        "king",
        "kings",
        "knight",
        "knights",
        "laborer",
        "laborers",
        "labourer",
        "labourers",
        "ladies",
        "lady",
        "landlord",
        "landlords",
        "lawmaker",
        "lawmakers",
        "lawyer",
        "lawyers",
        "leader",
        "leaders",
        "lecturer",
        "lecturers",
        "legislator",
        "legislators",
        "liberal",
        "liberals",
        "lieutenant",
        "lieutenants",
        "lifeguard",
        "lifeguards",
        "lobbyist",
        "lobbyists",
        "loser",
        "losers",
        "magician",
        "magicians",
        "majorities",
        "majority",
        "maker",
        "makers",
        "male",
        "males",
        "man",
        "manager",
        "managers",
        "marathoner",
        "marathoners",
        "marketer",
        "marketers",
        "mate",
        "mates",
        "mathematician",
        "mathematicians",
        "mayor",
        "mayors",
        "member",
        "members",
        "men",
        "mentee",
        "mentees",
        "mentor",
        "mentors",
        "merchant",
        "merchants",
        "messenger",
        "messengers",
        "meteorologist",
        "meteorologists",
        "microbiologist",
        "microbiologists",
        "midwife",
        "midwives",
        "migrant",
        "migrants",
        "millionaire",
        "millionaires",
        "miner",
        "miners",
        "minorities",
        "minority",
        "model",
        "models",
        "mom",
        "moms",
        "mother",
        "mothers",
        "murderer",
        "murderers",
        "musician",
        "musicians",
        "native",
        "natives",
        "neighbor",
        "neighborhood",
        "neighborhoods",
        "neighbors",
        "neighbour",
        "neighbourhood",
        "neighbourhoods",
        "neighbours",
        "nephew",
        "nephews",
        "nephrologist",
        "nephrologists",
        "neurologist",
        "neurologists",
        "neurosurgeon",
        "neurosurgeons",
        "newborn",
        "newborns",
        "newcomer",
        "newcomers",
        "niece",
        "nieces",
        "nomad",
        "nomads",
        "nominee",
        "nominees",
        "nonresident",
        "nonresidents",
        "nurse",
        "nurses",
        "obstetrician",
        "obstetricians",
        "occupant",
        "occupants",
        "officer",
        "officers",
        "official",
        "officials",
        "oncologist",
        "oncologists",
        "onlooker",
        "onlookers",
        "operator",
        "operators",
        "ophthalmologist",
        "ophthalmologists",
        "opponent",
        "opponents",
        "optician",
        "opticians",
        "orderlies",
        "orderly",
        "organisation",
        "organisations",
        "organiser",
        "organisers",
        "organization",
        "organizations",
        "organizer",
        "organizers",
        "orthodontist",
        "orthodontists",
        "owner",
        "owners",
        "paediatrician",
        "painter",
        "painters",
        "panelist",
        "panelists",
        "parent",
        "parents",
        "participants",
        "partner",
        "partners",
        "passenger",
        "passengers",
        "pathologist",
        "pathologists",
        "patient",
        "patients",
        "patron",
        "patrons",
        "pediatrician",
        "pediatricians",
        "peer",
        "peers",
        "people",
        "performer",
        "performers",
        "person",
        "pharmacist",
        "pharmacists",
        "philosopher",
        "philosophers",
        "photographer",
        "photographers",
        "physician",
        "physicians",
        "physicist",
        "physicists",
        "pilot",
        "pilots",
        "pioneer",
        "pioneers",
        "player",
        "players",
        "plumber",
        "plumbers",
        "politician",
        "politicians",
        "pollster",
        "pollsters",
        "populace",
        "populaces",
        "population",
        "populations",
        "porter",
        "porters",
        "presenter",
        "presenters",
        "president",
        "presidents",
        "principal",
        "principals",
        "printer",
        "printers",
        "prisoner",
        "prisoners",
        "producer",
        "producers",
        "professional",
        "professionals",
        "professor",
        "professors",
        "programmer",
        "programmers",
        "progressive",
        "progressives",
        "proponent",
        "proponents",
        "prosecutor",
        "prosecutors",
        "prostitute",
        "prostitutes",
        "protestor",
        "protestors",
        "provider",
        "providers",
        "psychiatrist",
        "psychiatrists",
        "psychologist",
        "psychologists",
        "pulmonologist",
        "pulmonologists",
        "pundit",
        "pundits",
        "pupil",
        "pupils",
        "puppeteer",
        "puppeteers",
        "purchaser",
        "purchasers",
        "queen",
        "queens",
        "radiologist",
        "radiologists",
        "rapper",
        "rappers",
        "reader",
        "readers",
        "realtor",
        "realtors",
        "receptionist",
        "receptionists",
        "recipient",
        "recipients",
        "recruiter",
        "recruiters",
        "refugee",
        "refugees",
        "relative",
        "relatives",
        "reporter",
        "reporters",
        "representative",
        "representatives",
        "republican",
        "republicans",
        "researcher",
        "researchers",
        "resident",
        "residents",
        "retailer",
        "retailers",
        "reviewer",
        "reviewers",
        "rheumatologist",
        "rheumatologists",
        "rider",
        "riders",
        "rioter",
        "rioters",
        "rioters",
        "robber",
        "robbers",
        "rower",
        "rowers",
        "runner",
        "runners",
        "sailor",
        "sailors",
        "salespeople",
        "salesperson",
        "scholar",
        "scholars",
        "school",
        "schools",
        "scientist",
        "scientists",
        "scout",
        "scouts",
        "screenwriter",
        "screenwriters",
        "seller",
        "sellers",
        "senator",
        "senators",
        "senior",
        "seniors",
        "sergeant",
        "sergeants",
        "servant",
        "servants",
        "server",
        "servers",
        "shopper",
        "shoppers",
        "shortstop",
        "shortstops",
        "singer",
        "singers",
        "sister",
        "sisters",
        "skateboarder",
        "skateboarders",
        "skater",
        "skaters",
        "skier",
        "skiers",
        "snowboarder",
        "snowboarders",
        "societies",
        "society",
        "soldier",
        "soldiers",
        "solicitor",
        "solicitors",
        "son",
        "sons",
        "sophomore",
        "sophomores",
        "speaker",
        "speakers",
        "specalists",
        "specialist",
        "spectator",
        "spectators",
        "sprinter",
        "sprinters",
        "squad",
        "squads",
        "start-up",
        "start-ups",
        "stranger",
        "strangers",
        "student",
        "students",
        "studies",
        "studnets",
        "subscriber",
        "subscribers",
        "supervisor",
        "supervisors",
        "supplier",
        "suppliers",
        "supporter",
        "supporters",
        "surfer",
        "surfers",
        "surgeon",
        "surgeons",
        "swimmer",
        "swimmers",
        "tailor",
        "tailors",
        "teacher",
        "teachers",
        "team",
        "teammate",
        "teammates",
        "teams",
        "technician",
        "technicians",
        "teenager",
        "teenagers",
        "tenant",
        "tenants",
        "thief",
        "thieves",
        "toddler",
        "toddlers",
        "tourist",
        "tourists",
        "trader",
        "traders",
        "traveler",
        "travelers",
        "traveller",
        "travellers",
        "triathlete",
        "triathletes",
        "trucker",
        "truckers",
        "uncle",
        "uncles",
        "universities",
        "university",
        "urologist",
        "urologists",
        "user",
        "users",
        "vegan",
        "vegans",
        "vegetarian",
        "vegetarians",
        "vendor",
        "vendors",
        "vet",
        "veteran",
        "veterans",
        "veterinarian",
        "veterinarians",
        "vets",
        "vice president",
        "vice presidents",
        "viewer",
        "viewers",
        "villager",
        "villagers",
        "visitor",
        "visitors",
        "voter",
        "voters",
        "waiter",
        "waiters",
        "waitress",
        "waitresses",
        "weightlifter",
        "weightlifters",
        "wife",
        "winner",
        "winners",
        "witness",
        "witnesses",
        "wives",
        "woman",
        "women",
        "worker",
        "workers",
        "wrestler",
        "wrestlers",
        "writer",
        "writers"
    ],
    "disease": [
        "chest cold",
        "anthrax",
        "als registry",
        "zoonotic hookworm",
        "crops",
        "q fever",
        "runny nose",
        "cat flea tapeworm",
        "crohn’s disease",
        "stari",
        "flavorings-related lung disease",
        "sinus infection",
        "hyperthermia",
        "environmental hearing loss",
        "hearing loss",
        "h3n2v influenza",
        "influenza, variant",
        "pulmonary hypertension",
        "myelomeningocele",
        "flavivirus infections",
        "peripheral arterial disease",
        "african trypanosomiasis",
        "clonorchis infection",
        "stds",
        "capillaria infection",
        "chlamydia",
        "vaginal and vulvar cancers",
        "chapare hemorrhagic fever",
        "heterophyes infection",
        "mycobacterium avium complex",
        "mycoplasma pneumoniae infection",
        "kyasanur forest disease",
        "uterine cancer",
        "alkhurma hemorrhagic fever",
        "hemophilia treatment centers",
        "seasonal flu",
        "mucus",
        "cryptosporidiosis",
        "vre",
        "winter storms",
        "canine flu",
        "raccoon roundworm infection",
        "rubeola",
        "chikv",
        "schistosomiasis",
        "chlamydia pneumoniae infection",
        "blastomycosis",
        "parvovirus b19 infection",
        "viral hemorrhagic fevers",
        "aseptic meningitis",
        "lead poisoning",
        "stec",
        "tbrf",
        "kidney disease",
        "gonorrhea",
        "hpv infection",
        "childhood injuries",
        "necrotizing fasciitis",
        "lassa fever",
        "vision impairment",
        "clonorchiasis",
        "tb",
        "tetanus",
        "flea-borne",
        "entamoeba histolytica infection",
        "ancylostoma duodenale infection",
        "necator americanus infection",
        "otitis media",
        "hiv",
        "kd",
        "concussion",
        "aortic dissection",
        "pontiac fever",
        "birth defects",
        "scrub typhus",
        "dvt",
        "classic creutzfeldt-jakob disease",
        "enterovirus infections",
        "fungal eye infections",
        "leprosy",
        "blood disorders",
        "leishmania infection",
        "respiratory syncytial virus infection",
        "alzheimer's disease",
        "systemic lupus erythematosus",
        "extreme heat",
        "dengue",
        "meningitis",
        "coal workers' pneumoconioses",
        "cmv",
        "human ehrlichiosis",
        "newborn hearing",
        "ev-d68",
        "tuberculosis skin test",
        "nutrition",
        "2019-ncov",
        "chhf",
        "clostridium tetani infection",
        "hiv",
        "aids",
        "stds",
        "marburg hemorrhagic fever",
        "vvc",
        "viral meningitis",
        "pertussis",
        "fasciola infection",
        "capillariasis",
        "zika virus infection",
        "thrombosis",
        "ciguatoxin",
        "diphtheria",
        "poxvirus infections",
        "newborn jaundice",
        "loiasis",
        "methicillin resistant staphylococcus aureus",
        "marine toxins",
        "trichinosis",
        "genital warts",
        "rheumatoid arthritis",
        "muscular dystrophy",
        "varicella-zoster virus infection",
        "listeriosis",
        "botulism",
        "trichuriasis",
        "tularemia",
        "sexually transmitted diseases",
        "strep throat",
        "treponema pallidum infection",
        "cfs",
        "dirofilariasis",
        "cervical cancer",
        "cancer",
        "carrion's disease",
        "animal-related diseases",
        "sfgr",
        "neisseria gonorrhoeae infection",
        "nbccedp",
        "rvf",
        "trench fever",
        "ts",
        "dementia",
        "hab",
        "harmful algal bloom",
        "hab-associated illness",
        "h1n1 flu",
        "group b streptococcal infection",
        "balamuthia infection",
        "lymphatic filariasis",
        "nocardia asteroides infection",
        "giardia infection",
        "paragonimus infection",
        "c. auris infection",
        "coal workers pneumoconioses",
        "pneumoconioses",
        "brainerd diarrhea",
        "lockjaw",
        "variant creutzfeldt-jakob disease",
        "mers-cov",
        "meningococcal disease",
        "seizure disorder",
        "evd",
        "epidemic typhus",
        "inflammatory bowel disease",
        "oropharyngeal candidiasis",
        "pid",
        "measles",
        "lupus",
        "hfmd",
        "wnv infection",
        "viral hepatitis",
        "hantavirus pulmonary syndrome",
        "herpes zoster",
        "murine typhus",
        "copd",
        "spotted fever group rickettsia",
        "rsv",
        "mad cow disease",
        "pneumococcal disease",
        "monkey b virus",
        "diabetes",
        "fungal endophthalmitis",
        "kala-azar",
        "foodborne illnesses",
        "fascioliasis",
        "h5n1",
        "soil transmitted helminths",
        "luhf",
        "salmonella typhi infection",
        "sodium",
        "mycobacterium abscessus infection",
        "bacillus anthracis",
        "group a streptococcal infection",
        "traumatic brain injury",
        "acinetobacter infection",
        "whitmore's disease",
        "fetp",
        "strongyloidiasis",
        "la crosse encephalitis",
        "angiostrongylus infection",
        "chronic obstructive pulmonary disease",
        "monkeypox",
        "enterovirus d68",
        "gnathostomiasis",
        "shigellosis",
        "c. gattii cryptococcosis",
        "motor vehicle injuries",
        "sore throat",
        "typhoid fever",
        "burkholderia cepacia infection",
        "sars",
        "infertility",
        "tuberculosis and hiv coinfection",
        "osteoarthritis",
        "balantidiasis",
        "melioidosis",
        "vulvovaginal candidiasis",
        "necrotizing fasciitis",
        "brucellosis",
        "influenza and cancer",
        "human papillomavirus infection",
        "hendra virus disease",
        "west nile virus infection",
        "lyme disease",
        "trichinellosis",
        "peripheral arterial occlusive disease",
        "yellow fever",
        "gae",
        "tickborne diseases",
        "opisthorchis infection",
        "cronobacter infection",
        "tinea",
        "colorectal",
        "peripheral vascular disease",
        "blastocystis infection",
        "rodents",
        "peripheral arterial insufficiency",
        "mental retardation",
        "norovirus infection",
        "trypanosoma cruzi infection",
        "harmless intestinal protozoa",
        "e. coli infection",
        "pubic lice",
        "lymphocytic choriomeningitis",
        "pcp infection",
        "hymenolepis infection",
        "herpes b virus",
        "carbapenem-resistant enterobacteriaceae",
        "tick-borne relapsing fever",
        "fungal meningitis",
        "staphylococcus aureus infection",
        "sids",
        "vancomycin-resistant enterococci infection",
        "aids",
        "german measles",
        "murine",
        "coccidioidomycosis",
        "pad",
        "hemophilia",
        "von willebrand disease",
        "fungal diseases",
        "fifth disease",
        "hearing impairment",
        "acanthamoeba",
        "gae",
        "acanthamoeba",
        "influenza in pigs",
        "sore mouth infection",
        "vancomycin-intermediate staphylococcus aureus infections",
        "vancomycin-resistant staphylococcus aureus infections",
        "recreational water illnesses",
        "vibriosis",
        "haemophilus influenzae serotype b",
        "myalgic encephalomyelitis",
        "chronic fatigue syndrome",
        "prion diseases",
        "taenia infection",
        "rickettsia rickettsii infection",
        "nairovirus infection",
        "coronavirus",
        "zoonotic enteric diseases",
        "women's bleeding disorders",
        "powassan",
        "nonpathogenic",
        "oral cancer",
        "cancer",
        "eastern equine encephalitis",
        "rbf",
        "japanese encephalitis",
        "variola minor virus infection",
        "colorado tick fever",
        "zoonotic hookworm",
        "urdo",
        "campylobacter infection",
        "hand disease",
        "foot disease",
        "mouth disease",
        "hot tub rash",
        "chagas disease",
        "pneumonia",
        "escherichia coli infection",
        "ebola virus disease",
        "ebola virus",
        "ebola",
        "human ehrlichiosis",
        "mucormycosis",
        "rickettsial diseases",
        "gas",
        "k. pneumoniae",
        "fungal keratitis",
        "cat scratch disease",
        "extensively drug-resistant tb",
        "plague",
        "heat stress",
        "human hookworm",
        "schistosoma infection",
        "chlamydia trachomatis disease",
        "clotting disorders",
        "rwi",
        "gdder",
        "sappinia diploidea and sappinia pedata",
        "african trypanosomiasis",
        "tses",
        "group a strep infection",
        "strep infection",
        "non-polio",
        "amyotrophic lateral sclerosis",
        "dog heartworm",
        "common cold",
        "national amyotrophic lateral sclerosis",
        "viral hepatitis",
        "hepatitis",
        "phthiriasis",
        "universal newborn hearing screening",
        "vcjd",
        "poliomyelitis infection",
        "b virus infection",
        "cerebral palsy",
        "crimean-congo hemorrhagic fever",
        "herpes, genital",
        "hypothermia",
        "pseudomonas aeruginosa infection",
        "isospora infection",
        "lujo hemorrhagic fever",
        "southern tick-associated rash illness",
        "septic shock",
        "ntd",
        "head lice",
        "myiasis",
        "testicular cancer",
        "legionnaires' disease",
        "leishmaniasis",
        "echinococcosis",
        "balantidium infection",
        "sleeping sickness",
        "pseudomonas dermatitis infection",
        "lou gehrig's disease",
        "sleep and sleep disorders",
        "pedestrian injury",
        "kernicterus",
        "latex allergies",
        "hev infection",
        "rat-bite fever",
        "sudden infant death syndrome",
        "attention deficit",
        "hyperactivity disorder",
        "variola major virus infection",
        "black lung",
        "cyclosporiasis",
        "congenital hearing loss",
        "symptom relief for upper respiratory infections",
        "bartonella quintana infection",
        "als",
        "fragile x syndrome",
        "tuberculosis training",
        "dwarf tapeworm",
        "giardiasis",
        "arthritis",
        "pneumocystis pneumonia",
        "ticks",
        "trachoma infection",
        "ahf",
        "varicella zoster virus",
        "american trypanosomiasis",
        "dphswd",
        "swimmer's itch",
        "hiv",
        "aids",
        "cryptosporidium infection",
        "psittacosis",
        "clostridium difficile infection",
        "lbrf",
        "hpv-associated cancers",
        "gbs",
        "folliculitis",
        "valley fever",
        "ehdi",
        "trichomoniasis",
        "tapeworm",
        "dog flea",
        "cat flea",
        "noise exposure",
        "paragonimiasis",
        "yersinia enterocolitica infection",
        "ebv infection",
        "pulmonary embolism",
        "fasciolopsis infection",
        "cchf",
        "shigella infection",
        "epilepsy",
        "tuberculosis",
        "nonpathogenic intestinal amebae infection",
        "intestinal amebae infection",
        "upper respiratory infection symptom relief",
        "mac",
        "tapeworm infection",
        "scabies",
        "cytomegalovirus infection",
        "ppv",
        "nlv",
        "hab-associated illness",
        "pelvic inflammatory disease",
        "varicella disease",
        "vhf",
        "harmful algal bloom",
        "harmful algal bloom-associated illness",
        "hab",
        "hab-associated illness",
        "naegleria infection",
        "sporothrix schenckii infection",
        "vzv",
        "ascariasis",
        "polio infection",
        "corynebacterium diphtheria infection",
        "pow virus",
        "cov",
        "rift valley fever",
        "sappinia infection",
        "ringworm",
        "herpesvirus b",
        "fasciolopsiasis",
        "visa",
        "vrsa",
        "bartonella infection",
        "ringworm from animals",
        "trichomonas infection",
        "malaria",
        "influenza",
        "cre",
        "listeria infection",
        "vector-borne diseases",
        "lcm",
        "strongyloides infection",
        "rodent control",
        "leptospira infection",
        "middle east respiratory syndrome coronavirus",
        "coronavirus",
        "dipylidium infection",
        "ascaris infection",
        "blastocystis hominis infection",
        "high blood pressure",
        "cwd",
        "pediculus humanus corporis",
        "bv",
        "ovarian cancer",
        "acanthamoeba infection",
        "salmonellosis",
        "pneumocystis jirovecii pneumonia",
        "lymphedema",
        "gynecologic cancers",
        "anisakiasis",
        "kfd",
        "cysticercosis",
        "prostate cancer",
        "sporotrichosis",
        "dog flea tapeworm",
        "influenza",
        "epstein-barr virus infection",
        "md",
        "neurocysticercosis",
        "toxocara infection",
        "pcv",
        "ergonomic and musculoskeletal disorders",
        "ergonomic disorders",
        "musculoskeletal disorders",
        "bartonella henselae infection",
        "c. neoformans cryptococcosis",
        "global measles elimination",
        "river blindness",
        "streptobacillus moniliformis infection",
        "borreliosis, tick-borne",
        "tick-borne borreliosis",
        "cholera",
        "down syndrome",
        "molluscum contagiosum",
        "c. gattii. cryptococcosis, ",
        "cryptococcosis",
        "rubella",
        "ibd",
        "chronic fatigue syndrome",
        "primary amebic meningoencephalitis",
        "acquired immune deficiency syndrome",
        "rabies",
        "bartonella bacilliformis infection",
        "jamestown canyon virus infection",
        "afm",
        "immunization",
        "orf virus infection",
        "smallpox",
        "acanthamoeba keratitis",
        "keratitis",
        "intestinal amebiasis",
        "amebiasis",
        "htc",
        "arenavirus infections",
        "omsk hemorrhagic fever",
        "anaplasmosis, human",
        "mdr tb",
        "ear infection",
        "nocardiosis",
        "babesiosis",
        "bilharzia",
        "lockjaw infection",
        "liver disease and hepatitis",
        "onchocerciasis",
        "je",
        "fxs",
        "drug resistance",
        "spina bifida",
        "brucella infection",
        "mold",
        "xdr tb",
        "impetigo",
        "deep vein thrombosis",
        "sepsis",
        "pet-related diseases",
        "screening for critical congenital heart defects",
        "dog bites",
        "diphyllobothrium infection",
        "shingles",
        "carpal tunnel syndrome",
        "flu, pandemic",
        "rotavirus infection",
        "exserohilum rostratum",
        "group b strep infection",
        "cdi",
        "tetanus disease",
        "toxoplasma infection",
        "scarlet fever",
        "cte",
        "francisella tularensis infection",
        "fungal pneumonia",
        "sickle cell disease",
        "hypertension",
        "enterobius vermicularis infection",
        "campy",
        "kawasaki disease",
        "pam",
        "zoster",
        "septicemia",
        "balamuthia mandrillaris infection",
        "cooley's anemia",
        "genital herpes",
        "group a strep infection",
        "vwd",
        "filovirus infections",
        "microcephaly",
        "typhus fevers",
        "body lice",
        "loa loa infection",
        "b. cepacia infection",
        "cyanobacterial algal bloom-associated illness",
        "back belts",
        "herpes simplex virus infection",
        "salmonella infection",
        "stroke",
        "carbapenem resistant klebsiella pneumonia",
        "anisakis infection",
        "bronchiolitis",
        "hansen's disease",
        "aortic aneurysm",
        "bird flu",
        "relapsing fever, tick-borne",
        "elizabethkingia infection",
        "borrelia burgdorferi infection",
        "mycotic diseases",
        "hearing loss in children",
        "neglected tropical diseases",
        "diphyllobothriasis",
        "pcp",
        "blood clot",
        "chikungunya fever",
        "atrial fibrillation",
        "antibiotic resistance",
        "antimicrobial resistance",
        "musculoskeletal disorders",
        "acute flaccid myelitis",
        "histoplasmosis",
        "dientamoeba fragilis infection",
        "microsporidia infection",
        "swimming-related illness",
        "chronic kidney disease",
        "fetal alcohol spectrum disorders",
        "infectious mononucleosis",
        "bacterial meningitis",
        "immpact",
        "asthma",
        "afib, af",
        "infectious mononucleosis",
        "mononucleosis",
        "crccp",
        "c. diff. infection",
        "crkp",
        "rmsf",
        "clostridium perfringens infection",
        "la crosse encephalitis virus",
        "whipworm infection",
        "vibrio cholerae infection",
        "eee",
        "ulcerative colitis",
        "pneumocystis carinii pneumonia",
        "human hookworm",
        "hookworm",
        "tourette syndrome",
        "previously pneumocystis carinii",
        "leptospirosis",
        "burkholderia pseudomallei infection",
        "chlamydia psittaci infection",
        "pe",
        "cyclospora infection",
        "bcg",
        "adhd",
        "parasitic diseases",
        "skin cancer",
        "clostridium botulinum infection",
        "zika virus infection",
        "swine influenza",
        "thrush",
        "aspergillus infection",
        "toxocariasis",
        "pubic lice",
        "rickettsia",
        "spotted fever grou prickettsia",
        "bunyavirus infections",
        "guillain-barré syndrome",
        "hps",
        "chronic disease indicators",
        "staph",
        "toxoplasmosis",
        "lymphatic filariasis",
        "breast cancer",
        "streptococcus pneumoniae infection",
        "genital candidiasis",
        "invasive candidiasis",
        "legionellosis",
        "salmonella infection from animals",
        "pinworm infection",
        "microalgal bloom-associated illness",
        "group b strep infection",
        "strep infection",
        "pink eye",
        "colon cancer",
        "heart disease",
        "head lice",
        "gout",
        "bovine spongiform encephalopathy",
        "ra",
        "farm worker injuries",
        "thrombophilia",
        "cat scratch disease from pets",
        "coxiella burnetii infection",
        "mumps",
        "body lice",
        "baylisascaris infection",
        "transmissible spongiform encephalopathies",
        "histoplasma capsulatum infection",
        "shiga toxin-producing e. coli",
        "bronchitis",
        "cryptococcosis, c. neoformans",
        "tb and hiv coinfection",
        "gae",
        "acanthamoeba",
        "granulomatous amebic encephalitis",
        "emerging infectious diseases",
        "congenital heart defects",
        "spirillum minus infection",
        "autism",
        "psoriasis",
        "outbreaks",
        "kawasaki syndrome",
        "elephantiasis",
        "lung cancer",
        "ohf",
        "adenovirus infection",
        "hib infection",
        "glanders",
        "trisomy 21",
        "tb in african-americans",
        "bacterial vaginosis",
        "conjunctivitis",
        "pediculus humanus capitis",
        "sle",
        "bse",
        "gnathostoma infection",
        "creutzfeldt-jakob disease, classic",
        "esophageal candidiasis",
        "jaundice",
        "yeast infection",
        "dermatophyte infection",
        "lacv",
        "cystoisospora infection",
        "strep throat",
        "campylobacteriosis",
        "thoracic aortic aneurysm",
        "tbi",
        "cercarial dermatitis",
        "mycobacterium tuberculosis infection",
        "chronic wasting disease",
        "rubella virus",
        "multiple organ dysfunction syndrome",
        "flea-borne typhus",
        "human immunodeficiency virus",
        "novel coronavirus",
        "undulant fever",
        "ace",
        "harmful algal bloom",
        "burkholderia mallei",
        "babesia infection",
        "micronutrient malnutrition",
        "csd",
        "chickenpox",
        "vaginal candidiasis",
        "aspergillosis",
        "oa",
        "herpesvirus simiae",
        "hereditary bleeding disorders",
        "bacillus anthracis infection",
        "heterophyiasis",
        "ckd",
        "dracunculiasis",
        "hemoglobinopathies",
        "klebsiella pneumoniae",
        "syphilis",
        "lac",
        "mrsa",
        "thalassemia",
        "blastomyces dermatitidis infection",
        "yersinia pestis infection",
        "sinusitus",
        "unexplained respiratory disease outbreaks",
        "lice",
        "avian influenza",
        "multidrug-resistant tb",
        "non-polio enterovirus infections",
        "other pathogenic fungi",
        "severe acute respiratory syndrome",
        "heartland virus infection",
        "vibrio illness",
        "granulomatous amebic encephalitis",
        "corynebacterium diphtheriae infection",
        "guinea worm disease",
        "ctf",
        "avian influenza",
        "chronic traumatic encephalopathy",
        "fibromyalgia",
        "childhood arthritis",
        "parainfluenza",
        "candida auris infection",
        "cystoisosporiasis",
        "rocky mountain spotted fever",
        "ciguatera fish poisoning",
        "adverse childhood experiences",
        "yersiniosis",
        "viral hemorrhagic fevers",
        "salt",
        "cjd",
        "classic cjd",
        "carrión’s disease",
        "hpiv",
        "depression"
    ],
    "hermaphrodite-animals": [
        "snail",
        "snails",
        "echinoderm",
        "echinoderms",
        "worm",
        "worms",
        "fish",
        "bearded dragon",
        "wrasse",
        "wrasses",
        "banana slug",
        "banana slugs",
        "hiptail lizard",
