import requests
from bs4 import BeautifulSoup


def Word(kalameh):
    """سلام من یک کتابخانه هستم که به دست سیدمعین داورزنی برای پایتون نوشته شده ام. با دادن یک رشته به تابع Word من
    می تونید به صورت آنلاین معنا دار بودن آن را در لغت‌نامه دهخدا :: فرهنگ فارسی معین :: فرهنگ فارسی عمید :: واژگان
    مترادف و متضاد :: واژه‌های مصوّب فرهنگستان :: واژه‌های فارسی سره :: فرهنگ گنجواژه :: واژه‌نامه آزاد :: فرهنگ
    برندواژه :: اصطلاحات عامیانه :: فرهنگ نام‌ها :: فرهنگ واژگان قرآن :: فرهنگ لغات علمی گویش‌ها :: لهجه و گویش
    اصفهانی :: لهجه و گویش بختیاری :: لهجه و گویش تهرانی :: لهجه و گویش دزفولی :: لهجه و گویش گنابادی :: لهجه و گویش
    مازنی برسی کنید. """
    try:
        return "\n" + " " + "\n" + "واژه‌ای یافت نشد." + "\n" != BeautifulSoup(
            requests.get("https://vajehyab.com/?q=" + str(kalameh)).text, "html.parser").find("div",
                                                                                              class_="search-container").get_text()
    except:
        print("Check your internet connection")
        return False


def list_words(list_kalameh):
    """سلام من یک کتابخانه هستم که به دست سیدمعین داورزنی برای پایتون نوشته شده ام. با دادن یک لیست به تابع
    list_word من می تونید به صورت آنلاین عضو های معنا دار آن را در لغت‌نامه دهخدا :: فرهنگ فارسی معین ::
    فرهنگ فارسی عمید :: واژگان مترادف و متضاد :: واژه‌های مصوّب فرهنگستان :: واژه‌های فارسی سره :: فرهنگ گنجواژه ::
    واژه‌نامه آزاد :: فرهنگ برندواژه :: اصطلاحات عامیانه :: فرهنگ نام‌ها :: فرهنگ واژگان قرآن :: فرهنگ لغات علمی
    گویش‌ها :: لهجه و گویش اصفهانی :: لهجه و گویش بختیاری :: لهجه و گویش تهرانی :: لهجه و گویش دزفولی :: لهجه و گویش
    گنابادی :: لهجه و گویش مازنی دریافت کنید. """
    p = 0
    if type(list_kalameh) != list:
        list_kalameh = list(str(list_kalameh))
    for i in range(0, len(list_kalameh)):
        if Word( list_kalameh[i-p] ) == False:
            list_kalameh.pop(i-p)
            p += 1

    return list_kalameh
